In [17]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [3]:
df = pd.read_csv("carprices.csv")
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

In [9]:
X = df.drop("Sell Price($)",axis=1)
X.head()

   Mileage  Age(yrs)
0    69000         6
1    35000         3
2    57000         5
3    22500         2
4    46000         4

In [10]:
y=df['Sell Price($)']
y.head()

0    18000
1    34000
2    26100
3    40000
4    31500
Name: Sell Price($), dtype: int64

In [11]:
X_train, X_test, y_train, y_test =  train_test_split(X,y,test_size=0.2,random_state=1)

In [15]:
X_train # 16

    Mileage  Age(yrs)
2     57000         5
14    82450         7
4     46000         4
17    69000         5
7     72000         6
1     35000         3
13    58780         4
0     69000         6
19    52000         5
18    87600         8
9     67000         6
15    25400         3
8     91000         8
12    59000         5
11    79000         7
5     59000         5

In [16]:
X_test # 4

    Mileage  Age(yrs)
3     22500         2
16    28000         2
6     52000         5
10    83000         7

In [18]:
model = LinearRegression()

In [19]:
model.fit(X_train,y_train)

LinearRegression()

In [20]:
model.predict(X_test)

array([38678.88629877, 37165.09880349, 27154.64686973, 16352.50089646])

In [21]:
y_test

3     40000
16    35500
6     32000
10    18700
Name: Sell Price($), dtype: int64

In [22]:
model.score(X_test,y_test)

0.867213195279367